## pandas 데이터 분석을 할 때 가장 많이 쓰이는 패키지이다.

In [2]:
import pandas as pd

In [3]:
s = pd.Series([9904312 , 3448737 , 2890451 , 2466052] ,
             index = ["서울" , "부산" , "인천" , "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
pd.Series(range(10 ,14))
#range를 하는데 인덱스를 설정하지 않으면 알아서인덱스를 만들어준다.

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
s.index # s의 인덱스값 보여줘

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [6]:
type(s.index) # 인덱스 객체의 정보

pandas.core.indexes.base.Index

In [7]:
s.values # s의 밸류들 보여줘

array([9904312, 3448737, 2890451, 2466052])

In [8]:
type(s.values)

numpy.ndarray

In [9]:
s.name = "인구"
s.index.name = "도시"
s
#name 속성을 이용해서 시리즈데이터에 이름을 붙일수 있다. 
#index.name 속성으로 시리즈의 인덱스에도 이름을 붙일 수 있다.

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

numpy 배열처럼 시리즈도 벡터화 연산을 할 수 있다.
연산은 시리즈값에만 적용되며 인덱스 값은 변하지 않는다.

In [11]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [12]:
s[1] # 시리즈 인덱싱

3448737

In [13]:
s["부산"] # 인덱싱은 인덱스 라벨을 이용한 슬라이싱도 가능하다.

3448737

In [15]:
s[3] , s["대구"]

(2466052, 2466052)

배열 인덱싱을 하면 자료의 순서를 바꾸거나 특정한 자료만 선택할 수 있다.

In [16]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [17]:
s[["서울" , "대구" , "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [18]:
(250e4 < s) & (s < 500e4) # e4라는것은 거듭제곱 e4는 10의 4제곱

도시
서울    False
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [19]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [20]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [22]:
s["부산" : "대구"] #### 문자로 인덱싱을 할때는 마지막 인덱스도 포함!!

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

만약 라벨 값이 영문 문자열일 경우 마지 속성인것처럼(.)을 이용하여 접근할 수 있다.

In [23]:
s0 = pd.Series(range(3) , index = ["a" , "b" , "cc"])
s0

a     0
b     1
cc    2
dtype: int64

In [24]:
s0.a

0

In [25]:
s0.b

1

In [26]:
s0.cc

2

In [27]:
s0["a"]

0

In [28]:
"서울" in s

True

In [29]:
"대전" in s

False

items 메서드를 사용하면 for 루프를 통해 각 원소의 key와 value을 접근할수도있다.

In [30]:
for a in s.items():
    print(a)

('서울', 9904312)
('부산', 3448737)
('인천', 2890451)
('대구', 2466052)

In [31]:
for k , v in s.items():
    print("%s = %d" %(k , v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [33]:
s.items

<bound method Series.items of 도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64>

In [39]:
s2 = pd.Series({"서울" : 9631482 , "부산" : 3393191 , "인천" : 2632035 , "대전" : 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [40]:
s2.name = "우리나라"
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
Name: 우리나라, dtype: int64

In [41]:
s2.index

Index(['서울', '부산', '인천', '대전'], dtype='object')

In [44]:
s2.index.name = "도시"

In [45]:
s2

도시
서울    9631482
부산    3393191
인천    2632035
대전    1490158
Name: 우리나라, dtype: int64

In [46]:
s2 = pd.Series({"서울" : 9631482 , "부산" : 3393191 , "인천" : 2632035 , "대전" : 1490158} , index = ["부산" , "서울" , "인천" , "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [47]:
ds = s - s2 # 키값이 같은것끼리 연산
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
s.values - s2.values  # 같은 자리수끼리 연산

array([ 6511121, -6182745,   258416,   975894])

In [49]:
ds.notnull() # Null이 아닌 위치의 True

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [50]:
print(type(ds[ds.notnull()]))
ds[ds.notnull()]

<class 'pandas.core.series.Series'>

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [64]:
# 인구 증가율 
rs = (s - s2) / s2* 100 # 대구 , 대전은 값이 부족하므로 연산이 안됨
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [65]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [66]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [67]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [73]:
a = pd.Series(range(3) , index = ["a" , "b" , "c"])
b = pd.Series(range(4,7) , index = ["a" , "b" , "c"])
c = a + b
c

a    4
b    6
c    8
dtype: int64

In [74]:
d = a - b
d

a   -4
b   -4
c   -4
dtype: int64

In [76]:
e = a * b
e

a     0
b     5
c    12
dtype: int64

In [77]:
f = a / b
f

a    0.000000
b    0.200000
c    0.333333
dtype: float64

데이터 프레임 생성

In [105]:
data = { 
    "2015" : [9904312 , 3448738 , 2890451 , 2466052],
    "2010" : [9631482 , 3393191 , 2632035 , 2431774],
    "2005" : [9762546 , 3512547 , 2517680 , 2456016],
    "2000" : [9853972 , 3655437 , 2466338 , 2473990],
    "지역" : ["수도권" , "경상권" , "수도권" , "경상권"],
    "2010 - 2015 증가율 " : [0.0283 , 0.0163 , 0.0982 , 0.0141]
}

columns = ["지역" , "2015" , "2010" , "2005" , "2000" , "2010 - 2015 증가율"]
index = ["서울" , "부산" , "인천" , "대구"]

df = pd.DataFrame(data , index = index , columns = columns)
print(df)
df

     지역     2015     2010     2005     2000 2010 - 2015 증가율
서울  수도권  9904312  9631482  9762546  9853972             NaN
부산  경상권  3448738  3393191  3512547  3655437             NaN
인천  수도권  2890451  2632035  2517680  2466338             NaN
대구  경상권  2466052  2431774  2456016  2473990             NaN

     지역     2015     2010     2005     2000 2010 - 2015 증가율
서울  수도권  9904312  9631482  9762546  9853972             NaN
부산  경상권  3448738  3393191  3512547  3655437             NaN
인천  수도권  2890451  2632035  2517680  2466338             NaN
대구  경상권  2466052  2431774  2456016  2473990             NaN

In [79]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, nan],
       ['경상권', 3448738, 3393191, 3512547, 3655437, nan],
       ['수도권', 2890451, 2632035, 2517680, 2466338, nan],
       ['경상권', 2466052, 2431774, 2456016, 2473990, nan]], dtype=object)

In [80]:
type(df.values)

numpy.ndarray

In [81]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010 - 2015 증가율'], dtype='object')

In [82]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [83]:
df.index.name = "도시"
df.columns.name = "특성"
df.name = "도시별 인구"
print(df)
df

특성   지역     2015     2010     2005     2000 2010 - 2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972             NaN
부산  경상권  3448738  3393191  3512547  3655437             NaN
인천  수도권  2890451  2632035  2517680  2466338             NaN
대구  경상권  2466052  2431774  2456016  2473990             NaN

특성   지역     2015     2010     2005     2000 2010 - 2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972             NaN
부산  경상권  3448738  3393191  3512547  3655437             NaN
인천  수도권  2890451  2632035  2517680  2466338             NaN
대구  경상권  2466052  2431774  2456016  2473990             NaN

In [87]:
data = {
    "평균 홈런" : [20 , 12 , 26 , 7 , 16],
    "2018" : [37 , 26 , 43 , 6 , 20], 
    "2019" : [16 , 10 , 33 , 6 , 11],
    "2020" : [20 , 11 , 21 , 15 , 22],
    "2021" : [10 , 1 , 10 , 3 , 12]
    
}

columns = ["2018" , "2019" , "2020" , "2021" , "평균 홈런"]
index = ["이대호" , "손아섭" , "박병호" , "이정후" , "김현수"]
df3 = pd.DataFrame(data , index = index , columns = columns)
df3

     2018  2019  2020  2021  평균 홈런
이대호    37    16    20    10     20
손아섭    26    10    11     1     12
박병호    43    33    21    10     26
이정후     6     6    15     3      7
김현수    20    11    22    12     16

In [90]:
df3.T # 행과 열이 바뀜

       이대호  손아섭  박병호  이정후  김현수
2018    37   26   43    6   20
2019    16   10   33    6   11
2020    20   11   21   15   22
2021    10    1   10    3   12
평균 홈런   20   12   26    7   16

In [91]:
df3 # 원값이 바뀌는것이 아니고 일시적으로 변경만 해준것이다.

     2018  2019  2020  2021  평균 홈런
이대호    37    16    20    10     20
손아섭    26    10    11     1     12
박병호    43    33    21    10     26
이정후     6     6    15     3      7
김현수    20    11    22    12     16

In [97]:
df["2010 - 2015 증가율"] = df["2010 - 2015 증가율"] * 100
df

     지역     2015     2010     2005     2000 2010 - 2015 증가율
서울  수도권  9904312  9631482  9762546  9853972             NaN
부산  경상권  3448738  3393191  3512547  3655437             NaN
인천  수도권  2890451  2632035  2517680  2466338             NaN
대구  경상권  2466052  2431774  2456016  2473990             NaN

In [106]:
df["2010 - 2010 증가율"] = ((df["2010"] - df["2015"]) / df["2005"] * 100).round(2)
df

     지역     2015     2010     2005     2000 2010 - 2015 증가율  2010 - 2010 증가율
서울  수도권  9904312  9631482  9762546  9853972             NaN            -2.79
부산  경상권  3448738  3393191  3512547  3655437             NaN            -1.58
인천  수도권  2890451  2632035  2517680  2466338             NaN           -10.26
대구  경상권  2466052  2431774  2456016  2473990             NaN            -1.40

In [107]:
del df["2010 - 2015 증가율"]
df

     지역     2015     2010     2005     2000  2010 - 2010 증가율
서울  수도권  9904312  9631482  9762546  9853972            -2.79
부산  경상권  3448738  3393191  3512547  3655437            -1.58
인천  수도권  2890451  2632035  2517680  2466338           -10.26
대구  경상권  2466052  2431774  2456016  2473990            -1.40

In [108]:
print(type(df["2015"]))
print(df["2015"].shape)
df["2015"]

<class 'pandas.core.series.Series'>
(4,)

서울    9904312
부산    3448738
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [110]:
print(type(df[["2010" , "2015"]]))
df[["2010" , "2015"]]

<class 'pandas.core.frame.DataFrame'>

       2010     2015
서울  9631482  9904312
부산  3393191  3448738
인천  2632035  2890451
대구  2431774  2466052

In [111]:
print(type(df[["2010"]]))
print(df[["2010"]].shape)
df[["2010"]]

<class 'pandas.core.frame.DataFrame'>
(4, 1)

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [112]:
print(type(df["2010"]))
print(df["2010"].shape)
df["2010"]

<class 'pandas.core.series.Series'>
(4,)

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [113]:
try:
    df[0] ## 0 : 없는 키 사용
except Exception as e:
    print(type(e))

<class 'KeyError'>

In [114]:
import numpy as np
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [115]:
np_array = np.arange(12).reshape(3,4)
np_array[: , 2]

array([ 2,  6, 10])

In [116]:
np_array[: , 2].reshape(3,1)

array([[ 2],
       [ 6],
       [10]])

In [117]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [118]:
np_array[: , 1:3]

array([[ 1,  2],
       [ 5,  6],
       [ 9, 10]])

In [120]:
df

     지역     2015     2010     2005     2000  2010 - 2010 증가율
서울  수도권  9904312  9631482  9762546  9853972            -2.79
부산  경상권  3448738  3393191  3512547  3655437            -1.58
인천  수도권  2890451  2632035  2517680  2466338           -10.26
대구  경상권  2466052  2431774  2456016  2473990            -1.40

In [121]:
df["2015"] # 열 인덱싱 키값으로 인덱싱하면 열

서울    9904312
부산    3448738
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [122]:
df[2:] # 행 인덱싱 정수의 슬라이싱 => 행인덱싱

     지역     2015     2010     2005     2000  2010 - 2010 증가율
인천  수도권  2890451  2632035  2517680  2466338           -10.26
대구  경상권  2466052  2431774  2456016  2473990            -1.40

In [123]:
df[:1] # 행 인덱싱 정수의 슬라이싱으로 인덱싱하면 행

     지역     2015     2010     2005     2000  2010 - 2010 증가율
서울  수도권  9904312  9631482  9762546  9853972            -2.79

In [124]:
df[1:2]

     지역     2015     2010     2005     2000  2010 - 2010 증가율
부산  경상권  3448738  3393191  3512547  3655437            -1.58

In [125]:
df[1:3]

     지역     2015     2010     2005     2000  2010 - 2010 증가율
부산  경상권  3448738  3393191  3512547  3655437            -1.58
인천  수도권  2890451  2632035  2517680  2466338           -10.26

In [126]:
df["2015"]["서울"]

9904312

In [136]:
data = {
    "국어" : [80,90,70,30],
    "영어" : [90,70,60,40],
    "수학" : [90,60,80,70],
}
columns = ["국어" , "영어" , "수학"]
index = ["춘향" , "몽룡" , "향단" , "방자"]
df = pd.DataFrame(data , index = index , columns = columns)

df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [137]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [143]:
df[["국어" , "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [144]:
df["평균"] = df.mean(axis = 1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [145]:
df["영어"]["방자"] = 80

/var/folders/rs/q3tvc3s53gbblf3cd1ncwv2c0000gn/T/ipykernel_15036/1176306088.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

In [147]:
# 시각으로 보기에는 표처럼 보이지만 
# 따지고 보면 np.array이기에 mean의 사용이 가능하다.
df["평균"] = df.mean(axis = 1)

In [148]:
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  59.166667

In [149]:
df["영어"]["방자"]

80

In [151]:
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [158]:
print(type(df.iloc[2]))
df.iloc[2] # 시리즈로

<class 'pandas.core.series.Series'>

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [160]:
# 샘플 데이터로 활용할 csv파일을 %%writefile로 생성하기
%%writefile /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample1.csv
c1 , c2 ,c3
1 , 1.11 one
2 , 2.22 two
3 , 3.33 three

Writing /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample1.csv

In [162]:
# 생성한 파일의 내용 읽어오기
import pandas as pd
import numpy as np
data = pd.read_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample1.csv")
data

   c1           c2   c3
0    1     1.11 one NaN
1    2     2.22 two NaN
2    3   3.33 three NaN

In [163]:
%%writefile /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample2.csv

1 , 1.11 one
2 , 2.22 two
3 , 3.33 three

Writing /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample2.csv

In [219]:
pd.read_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample1.csv" , names = ["c1" ,"c2" ,"c3"])

    c1           c2   c3
0  c1           c2    c3
1   1      1.11 one  NaN
2   2      2.22 two  NaN
3   3    3.33 three  NaN

In [221]:
pd.read_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample1.csv" , index_col = "c3")

     c1           c2
c3
NaN    1     1.11 one
NaN    2     2.22 two
NaN    3   3.33 three

In [201]:
%%writefile /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample3.txt

c1       c2       c3.      c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087037 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Overwriting /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample3.txt

In [172]:
pd.read_table("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample3.txt" , sep = "\s+")

         c1        c2       c3.       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087037 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [176]:
%%writefile /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample5.csv
c1 , c2 ,c3
1 , 1.11 one
2 , two
누락 , 3.33 three

Writing /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample5.csv

In [181]:
df = pd.read_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample5.csv" , na_values = ["누락"])
df

   c1           c2   c3
0   1      1.11 one NaN
1   2           two NaN
2  누락    3.33 three NaN

In [187]:
df.to_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample6.csv")

In [189]:
!cat /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample6.csv

,c1 , c2 ,c3
0,1 , 1.11 one,
1,2 , two,
2,누락 , 3.33 three,

In [196]:
df.to_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample7.txt" , sep = "|")

In [197]:
!cat /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample7.txt

|c1 | c2 |c3
0|1 | 1.11 one|
1|2 | two|
2|누락 | 3.33 three|

In [198]:
df.to_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample8.csv" , na_rep = "missing")

In [199]:
!cat /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample8.csv

,c1 , c2 ,c3
0,1 , 1.11 one,missing
1,2 , two,missing
2,누락 , 3.33 three,missing

In [204]:
df.index = ["a" , "b" , "c"]
df

   c1           c2   c3
a   1      1.11 one NaN
b   2           two NaN
c  누락    3.33 three NaN

In [206]:
df.to_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample9.csv" , index = False , header = False)

In [207]:
!cat /Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/sample9.csv

1 , 1.11 one,
2 , two,
누락 , 3.33 three,

In [209]:
df_titanic = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [210]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [213]:
df_titanic.to_csv("/Users/panhong/Desktop/coding_study/Likelion_KDT/Jupyter_notebook/csv_file/titnic.csv")

In [223]:
# 지정된 파일의 위에서부터 5개 내용
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [224]:
# 지정된 파일의 아래서부터 5개내용
df_titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

# 웹 크롤링

In [1]:
# 너무나 잘 알고있는 beatifulsoup , requests
import requests
from bs4 import BeautifulSoup

In [3]:
# requeests.get 해당 페이지의 html 코드를 가져옴
r = requests.get("https://wikidocs.net")
html = r.text
print(html)

<!DOCTYPE HTML>
<html lang="ko">
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="google-site-verification" content="mzkAy71X1qQFWihQN535LoiToXg34MUg9nuor7Og9E8" />
    <meta name="naver-site-verification" content="d7c116bce998e6961b8db93c8592550f1a82119f"/>
    <meta name="description" content="온라인 책을 제작 공유하는 플랫폼 서비스">

    <meta property="og:type" content="wikidocs">
    <meta property="og:title" content="위키독스">
    <meta property="og:description" content="온라인 책을 제작 공유하는 플랫폼 서비스">
    <meta property="og:image" content="https://wikidocs.net/images/book/wikidocs_1.png">
    <meta property="og:url" content="https://wikidocs.net">

    <link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
    <link rel="canonical" href="https://wikidocs.net/book/1">
    <title>WikiDocs</title>

    <!-- Latest compiled and minified CSS -->
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">

    <!-- Optional theme
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap-theme.min.css" integrity="sha384-rHyoN1iRsVXV4nD0JutlnGaslCJuC7uwjduW9SVrLvRYooPp2bWYgmgJQIXwl/Sp" crossorigin="anonymous">
    -->

    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="https://oss.maxcdn.com/html5shiv/3.7.3/html5shiv.min.js"></script>
    <script src="https://oss.maxcdn.com/respond/1.4.2/respond.min.js"></script>
    <![endif]-->


<link type="text/css" href="/static/pagination/pagination.css" rel="stylesheet"/>
<link type="text/css" href="/static/apprise/apprise.min.css" rel="stylesheet"  />

    <link type="text/css" href="/static/book/css/style_stack.css?v=20210106_02" rel="stylesheet"  media="screen" />

    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa" crossorigin="anonymous"></script>
    <script type="text/javascript" src="/static/book/js/utils.js"></script>
    <script type="text/javascript" src="/static/book/js/base.js?v=20210103_02"></script>

<script type="text/javascript" src="/static/pagination/jquery.pagination.js"></script>
<script type="text/javascript" src="/static/apprise/apprise-1.5.min.js"></script>
<script type="text/javascript" src="/static/book/js/index.js?v=20170528_01"></script>

    <script type="text/javascript">
      var _gaq = _gaq || [];
      _gaq.push(['_setAccount', 'UA-2686629-3']);
      _gaq.push(['_trackPageview']);

      (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
      })();

    </script>

    <!--
    <script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    -->
</head>
<body>


<nav class="navbar navbar-inverse navbar-static-top">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">
                WikiDocs
            </a>

            <!--
            <a class="navbar-brand navbar-adv" href="https://wikidocs.net/105844">
                <span class="text-warning" style="font-size:12px;font-weight:normal;color:orange"><span class="glyphicon glyphicon-volume-up"></span>
                    《Do it! 점프 투 장고》 책 출간!
                </span>
            </a>
            -->

        </div>
        <div class="navbar-collapse collapse">
            <ul class="nav navbar-nav navbar-right">

                <li><a href="/loginForm"><i class="glyphicon glyphicon-log-in"></i> 로그인</a></li>

            </ul>
        </div><!--/.navbar-collapse -->
    </div>

</nav>



<div class="jumbotron">
    <div class="container">
        <h1>WikiDocs</h1>
        <p style="margin-top:10px">
            위키독스는 온라인 책을 제작 공유하는 플랫폼 서비스입니다.
        </p>
        <p><a href="/help/wikidocs" class="btn btn-primary btn-lg">자세히 알아보기 &raquo;</a></p>
    </div>
</div>






<div class="container">
    <!--
    <div style="margin-bottom:20px;">
        <script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
        <ins class="adsbygoogle"
             style="display:block"
             data-ad-client="ca-pub-9470517771012578"
             data-ad-slot="6538649664"
             data-ad-format="auto"></ins>
        <script>
        (adsbygoogle = window.adsbygoogle || []).push({});
        </script>
    </div>
    -->

    <div class="index">
        <input type="hidden" name="tab_name" id="tab_name" value="sell" />
        <input type="hidden" name="tab_sort_type" id="tab_sort_type" value="recommend" />

        <ul class="nav nav-tabs" id="book-tab">
            <li book="sell"><a href="#_">추천책</a></li>
            <!--
            <li book="share"><a href="#_">공유책</a></li>
            -->
            <li book="all"><a href="#_">공개책</a></li>

        </ul>

        <div class="row">
            <div class="col-sm-6" style="margin-top:20px;margin-bottom:20px;">

                <div class="btn-group sort-type-group" data-toggle="buttons">
                  <label sort_type="recommend" class="btn btn-default btn-sm">
                    <input type="radio" name="sort_type" id="sort_type_recommend" autocomplete="off" value='recommend'> 추천순
                  </label>
                  <label sort_type="popular" class="btn btn-default btn-sm">
                    <input type="radio" name="sort_type" id="sort_type_popular" autocomplete="off" value='popular'> 인기순
                  </label>
                  <label sort_type="recent" class="btn btn-default btn-sm">
                    <input type="radio" name="sort_type" id="sort_type_recent" autocomplete="off" value='recent'> 최신순
                  </label>
                </div>
            </div>

            <div class="col-sm-4" style="margin-top:20px;margin-bottom:20px;">
                <div class="input-group">
                    <input type="text" id="kw" name="kw" class="form-control input-sm" placeholder="책제목 또는 지은이를 입력하세요">
                    <span class="input-group-btn">
                        <button id="search-book-btn" class="btn btn-sm btn-default" type="button">책검색</button>
                    </span>
                </div>
            </div>
        </div>


        <div class="tab-content">
            <div id="books" style="margin-top:10px;">





<div class="row book-item">

    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/1">
                    <div class="book-image-box">
                        <img src="/images//book/j2p_title_new2_S1JyeeE.jpg" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/1" class="book-subject">점프 투 파이썬</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/3">박응용</a>

                    </div>

                    <div>
                        - 2021년 07월 13일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('1')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>3,517</strong> 명이 추천</a>
                    </div>


                    <div style="margin-top:3px;">
                        - <a href="/buy/1" class="label label-default label-warning">e-book</a>
                    </div>

                </div>
            </div>
        </div>
    </div>



    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/110">
                    <div class="book-image-box">
                        <img src="/images//book/python_fPnJy3Q.jpg" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/110" class="book-subject">파이썬으로 배우는 알고리즘 트레이딩 (개정판-2쇄)</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link" href="/profile/info/book/400">조대표</a> 외 1명

                    </div>

                    <div>
                        - 2021년 05월 15일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('110')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>2,327</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>

</div>



<div class="row book-item">

    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/2155">
                    <div class="book-image-box">
                        <img src="/images//book/what-is-natural-language-processing.jpg" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/2155" class="book-subject">딥 러닝을 이용한 자연어 처리 입문</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/6876">유원준</a>

                    </div>

                    <div>
                        - 2021년 07월 03일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('2155')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>1,985</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>



    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/31">
                    <div class="book-image-box">
                        <img src="/images//book/javalogo_1.gif" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/31" class="book-subject">점프 투 자바</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/3">박응용</a>

                    </div>

                    <div>
                        - 2021년 07월 07일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('31')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>1,108</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>

</div>



<div class="row book-item">

    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/2">
                    <div class="book-image-box">
                        <img src="/images//book/chobo_python_title.png" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/2" class="book-subject">왕초보를 위한 Python: 쉽게 풀어 쓴 기초 문법과 실습</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/4">최용</a>

                    </div>

                    <div>
                        - 2021년 07월 10일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('2')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>727</strong> 명이 추천</a>
                    </div>


                    <div style="margin-top:3px;">
                        - <a href="/buy/2" class="label label-default label-warning">e-book</a>
                    </div>

                </div>
            </div>
        </div>
    </div>



    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/2788">
                    <div class="book-image-box">
                        <img src="/images//book/1_t6hCM90evdnlPw4l9VK3AQ.png" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/2788" class="book-subject">PyTorch로 시작하는 딥 러닝 입문</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/6876">유원준</a>

                    </div>

                    <div>
                        - 2021년 07월 06일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('2788')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>484</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>

</div>



<div class="row book-item">

    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/2165">
                    <div class="book-image-box">
                        <img src="/images//book/cover_2tGPBMt.png" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/2165" class="book-subject">PyQt5 Tutorial - 파이썬으로 만드는 나만의 GUI 프로그램</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link"  href="/profile/info/book/6895">Dardao</a>

                    </div>

                    <div>
                        - 2021년 05월 19일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('2165')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>436</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>



    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/922">
                    <div class="book-image-box">
                        <img src="/images//book/python300_zoR1Cof.PNG" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/922" class="book-subject">초보자를 위한 파이썬 300제</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link" href="/profile/info/book/400">조대표</a> 외 1명

                    </div>

                    <div>
                        - 2021년 05월 11일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('922')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>359</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>

</div>



<div class="row book-item">

    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/4315">
                    <div class="book-image-box">
                        <img src="/images//book/슬라이드1_세로.PNG" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/4315" class="book-subject">Must Learning with R (개정판)</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link" href="/profile/info/book/7936">DoublekPark</a> 외 1명

                    </div>

                    <div>
                        - 2021년 05월 01일
                    </div>

                    <div style="margin-top:0px;">
                        - <a style="font-size:11px" href="javascript:recommend_book('4315')"
                             class="btn btn-default btn-xs" title="추천"><i class="glyphicon glyphicon-thumbs-up"></i>
                        <strong>292</strong> 명이 추천</a>
                    </div>


                </div>
            </div>
        </div>
    </div>



    <div class="col-sm-6" style="margin-bottom:20px;">
        <div class="media">
            <div class="media-left">
                <a href="/book/1665">
                    <div class="book-image-box">
                        <img src="/images//book/bitcoin1.jpg" class="book-image" />
                    </div>
                </a>
            </div>
            <div class="media-body">
                <h4 class="media-heading">

                    <a href="/book/1665" class="book-subject">파이썬을 이용한 비트코인 자동매매 (개정판)</a>
                </h4>
                <div class="book-detail">
                    <div>
                        -

                        <a class="menu_link" href="/profile/info/book/400">조대표</a> 외 1명

                    </div>


In [4]:
res = requests.get("http://v.media.daum.net/v/20170615203441266")
# 파싱 개념??
soup = BeautifulSoup(res.content , "html.parser")
title = soup.find("title")
print(title.get_text())

잔금대출에도 DTI 규제 적용 검토

In [53]:
response = requests.get("http://movie.naver.com/movie/sdb/rank/rmovie.nhn")
html = response.text
soup = BeautifulSoup(html , "html.parser")
# select = div class tit3라는 소스를 모두 가져오겠다.
Title_html = soup.select("div[class = tit3]")
# print(Title_html)
# text만 찍어라

f = open("movie.txt" , "w")
for tag in soup.select("div[class = tit3]"):
    f.writelines(tag.text.strip() + "\n")
    print(tag.text.strip())
f.close()

블랙 위도우
랑종
발신제한
크루엘라
여고괴담 여섯번째 이야기 : 모교
미드나이트
킬러의 보디가드 2
콰이어트 플레이스 2
루카
제8일의 밤
인 더 하이츠
투모로우 워
괴기맨숀
체르노빌 1986
이스케이프 룸 2: 노 웨이 아웃
모가디슈
더 퍼지: 포에버
열아홉
비상선언
셔터
오필리아
이번엔 잘 되겠지
빛나는 순간
인질
우리는 매일매일
보스 베이비 2
기담
싱크홀
컨저링 3: 악마가 시켰다
분노의 질주: 더 얼티메이트
꽃다발 같은 사랑을 했다
스페이스 잼: 새로운 시대
극장판 귀멸의 칼날: 무한열차편
아이스 로드
시카다 3301
캐시트럭
곡성(哭聲)
어벤져스: 엔드게임
예스, 노 또는 반반
방법: 재차의
죽어도 좋은 경험
다크 앤드 위키드
미션 임파서블: 루벤
그린 북
트립 투 그리스
메이드 인 루프탑
와니와 준하
미드소마
나만 보이니
더 수어사이드 스쿼드

In [31]:
import requests , json
import time
from datetime import datetime
from time import sleep

f = open("date_hot_search.txt" , "w")
f1 = open("date_hot_search.txt2" , "w")
now_time = datetime.now().strftime("%X%Y%m%d%H%M")
new_data = []

def get_now():
    now = datetime.now().strftime("%X%Y%m%d%H%M")
    r = requests.get("http://www.nate.com/js/data/jsonLiveKeywordDataV1.js?v=" + now).content
    keyword_list = json.loads(r.decode("euc-kr"))
    result = []
    f = open("date_hot_search.txt" , "w")
    f.write(now_time + "\n")
    for k in keyword_list:
        result.append(k[1]) 
    for tag in result:
        new_data.append(tag)
        f.write(tag + "\n")
    return result    
print(get_now())

f = open("date_hot_search.txt" , "r")
line = f.readlines()
print(line)
f.close()

f1 = open("date_hot_search.txt2" , "r")
line1 = f1.readlines()
print(line1)
f1.close()

i = 0
while i < 10:
    get_now()
    time.sleep(60)
    if line1 != line:
        line1 = line
        f = open("date_hot_search.txt2" , "w")
        for number in line1:
            f.write(number)
        print("업데이트 완료")
        i += 1
    elif line1 == line:
        print("같습니다.")
        i += 1
    f.close()
    f1.close()

['아르헨티나와 2-2 무승부', '차기석', '하준수', '너는 나의 봄', '강철부대', '해방타운', '이수영 회장', '재난지원금', '최저임금', '오후 613명 최다']
['01:33:08202107140133\n', '아르헨티나와 2-2 무승부\n', '차기석\n', '하준수\n', '너는 나의 봄\n', '강철부대\n', '해방타운\n', '이수영 회장\n', '재난지원금\n', '최저임금\n', '오후 613명 최다\n']
[]
업데이트 완료
같습니다.
같습니다.

In [18]:
print(line1)
print(line)

now_time = datetime.now().strftime("%X%Y%m%d%H%M")

i = 0
while i < 3:
    time.sleep(10)
    get_now()
    if line1 != line:
        line1 = line
        f = open("date_hot_search.txt2" , "a")
        f.write(now_time + "\n")
        for number in line1:
            f.write(number + "\n")
        f.close()
        print("업데이트 완료")
        i += 1
    elif line1 == line:
        print("같습니다.")
        i += 1

['01:17:44202107140117\n', '아르헨티나와 2-2 무승부\n', '하준수\n', '차기석\n', '너는 나의 봄\n', '강철부대\n', '해방타운\n', '이수영 회장\n', '재난지원금\n', '최저임금\n', '오후 613명 최다\n']
['01:17:44202107140117\n', '아르헨티나와 2-2 무승부\n', '하준수\n', '차기석\n', '너는 나의 봄\n', '강철부대\n', '해방타운\n', '이수영 회장\n', '재난지원금\n', '최저임금\n', '오후 613명 최다\n']

ValueError: I/O operation on closed file.

In [17]:
print(line == line1)

True

In [156]:
import requests , json
import time
from datetime import datetime
from time import sleep
import random 

i = 0
while i < 5:
    a = random.randrange(1,10)
    b = random.randrange(1,5)
    time.sleep(3)
    if a != b:
        print(a)
        print(b)
        f = open("date_hot_search" , "a")
        now_time = datetime.now().strftime("%X%Y%m%d%H%M")
        f.write(str(i+1)+ "번째" + " \n" + now_time + "\n" + str(a))
        print("결과를 업데이트 합니다.")
        i += 1
    elif a == b:
        print(a)
        print(b)
        print("결과가 같습니다.")
        i += 1
    f = open("date_hot_search" , "w")
    f.write(now_time + "\n" + str(a))

4
4
결과가 같습니다.
2
1
결과를 업데이트 합니다.
8
1
결과를 업데이트 합니다.
2
3
결과를 업데이트 합니다.
6
2
결과를 업데이트 합니다.